interSolidCase/0/DT
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      DT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.127e-5;

boundaryField
{
    centerline1
    {
        type            symmetryPlane;
    }
    centerline2
    {
        type            symmetryPlane;
    }
    base
    {
        type            zeroGradient;
    }
    edges
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
