interSolidCase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298; 

boundaryField
{
    centerline1
    {
        type            symmetryPlane;
    }
    centerline2
    {
        type            symmetryPlane;
    }
    base
    {
        type            fixedValue;
        value           uniform 258;
    }
    edges
    {
        type            fixedValue;
        value           uniform 298;
    }
}


// ************************************************************************* //
