interSolidCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 0  0 0);
 

boundaryField
{
    centerline1
    {
        type            symmetryPlane;
    }
    centerline2
    {
        type            symmetryPlane;
    }
    base
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    edges
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
