interSolidCase/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "-1";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    centerline1
    {
        type            symmetryPlane;
    }
    centerline2
    {
        type            symmetryPlane;
    }
    base
    {
        type            fixedFluxPressure;
	U U;
	phi phi;
	rho rho;
        adjoint         no;
    }
    edges
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
