interSolidCase/constant/decompDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "constant";
    object      decompDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3
0
0
0
0
0
1
1
1
0
1
2
2
0
1
2
3


0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
0
1
2
3
...
3

3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
3
2
1
0
...
0


);
