interSolidCase/constant/setAlphaDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      setAlphaDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



x       x	[0 0 0 0 0 0 0]	0;
y	y	[0 0 0 0 0 0 0] 0;
z	z	[0 0 0 0 0 0 0] 0.002024;
r	r	[0 0 0 0 0 0 0] 0.001265;

U	U	[0 1 -1 0 0 0 0] (0 0 -0.977);


// ************************************************************************* //
