interSolidCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
    }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



application     interPhaseChangeHeatTranFoam;

startFrom       latestTime;
//startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          5e-4;

writeControl    adjustableRunTime;

writeInterval   1e-4;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           10;
maxAlphaCo      10;
maxDeltaT       0.0001;

//libs ("libtwoPhaseInterfaceProperties.so" );
//libs ("libtwoPhaseProperties.so" );


// ************************************************************************* //
